app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "testing tags"], ["created_at", "2014-05-15 17:52:56.897351"], ["name", "test"], ["updated_at", "2014-05-15 17:52:56.897351"]]